In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

### 실습 예제1
"BNW', 'Nissan', 'Honda', 'Audi'를 값으로 갖고 'one', 'two', 'three', 'four'를 인덱스로 갖는 시리즈 데이터 셋을 선언하시오

In [3]:
c = Series(['BMW', 'Nissan', 'Honda', 'Audi'], index = ['one','two', 'three', 'four'])
c

one         BMW
two      Nissan
three     Honda
four       Audi
dtype: object

### 실습예제 2
'BMW':15000, 'Nissan':8000, 'Honda':8000, 'Audi':10000를 사전(dictionary)으로 선언하고 해당 사전을 이용하여 시리즈 데이터셋을 선언하시오

In [4]:
dic = {'BMW':15000, 'Nissan':8000, 'Honda':8000, 'Audi':10000}
c= Series(dic)
c

Audi      10000
BMW       15000
Honda      8000
Nissan     8000
dtype: int64

### 실습예제 3
'name': ['Aaron Brooks', 'Brendan Haywood', 'Cory Joseph', 'Darius Miller'],
        'height': [180, 210, 187.5, 200],
        'weight': [72.45, 120.6, 86.85, 105.75]
        
인 사전을 이용하여 tFrame이란 이름을 가진 데이터프레임을 만드시오

In [5]:
sdata = {'name': ['Aaron Brooks', 'Brendan Haywood', 'Cory Joseph', 'Darius Miller'],
        'height': [180, 210, 187.5, 200],
        'weight': [72.45, 120.6, 86.85, 105.75]}
tFrame = DataFrame(sdata)
tFrame

   height             name  weight
0   180.0     Aaron Brooks   72.45
1   210.0  Brendan Haywood  120.60
2   187.5      Cory Joseph   86.85
3   200.0    Darius Miller  105.75

### 실습예제 4
인덱스를 'one', 'two', 'three', 'four'로 재정의 하시오

In [6]:
tFrame = DataFrame(sdata,   index=['one', 'two', 'three', 'four'])
tFrame

       height             name  weight
one     180.0     Aaron Brooks   72.45
two     210.0  Brendan Haywood  120.60
three   187.5      Cory Joseph   86.85
four    200.0    Darius Miller  105.75

### 실습예제 5
컬럼의 순서를 name, height, weight순으로 변경하시오

In [7]:
tFrame = DataFrame(sdata, columns=['name', 'height', 'weight'],
                   index=['one', 'two', 'three', 'four'])
tFrame

                  name  height  weight
one       Aaron Brooks   180.0   72.45
two    Brendan Haywood   210.0  120.60
three      Cory Joseph   187.5   86.85
four     Darius Miller   200.0  105.75

### 실습예제 6
tFrame의 name값을 출력하시오

In [8]:
tFrame.name

one         Aaron Brooks
two      Brendan Haywood
three        Cory Joseph
four       Darius Miller
Name: name, dtype: object

In [9]:
tFrame['name']

one         Aaron Brooks
two      Brendan Haywood
three        Cory Joseph
four       Darius Miller
Name: name, dtype: object

### 실습예제 7
tFrame의 컬럼(열)을 출력하시오

In [10]:
tFrame.columns

Index(['name', 'height', 'weight'], dtype='object')

### 실습예제 8
tFrame에 key 칼럼을 만들고 height가 200이상이면 True값을 넣고 200미만일 경우 False값을 넣으시오

In [11]:
tFrame['key'] = tFrame.height>200
tFrame

                  name  height  weight    key
one       Aaron Brooks   180.0   72.45  False
two    Brendan Haywood   210.0  120.60   True
three      Cory Joseph   187.5   86.85  False
four     Darius Miller   200.0  105.75  False

### 실습예제 9
del명령어를 사용하여 tFrame에서 key 칼럼을 삭제하고 칼럼을 출력하시오

In [12]:
del tFrame['key']
tFrame.columns

Index(['name', 'height', 'weight'], dtype='object')

### 실습예제 10
drop 함수를 이용하여 tFrame의 첫번째 행을 삭제하시오

In [13]:
tFrame.drop('one')

                  name  height  weight
two    Brendan Haywood   210.0  120.60
three      Cory Joseph   187.5   86.85
four     Darius Miller   200.0  105.75

### 실습예제 11
drop함수를 이용하여 name 칼럼을 삭제하고 원본데이터에 적용하시오

In [14]:
tFrame = tFrame.drop('name', axis=1)
tFrame

       height  weight
one     180.0   72.45
two     210.0  120.60
three   187.5   86.85
four    200.0  105.75

### 실습예제 12
del함수와 drop함수의 차이점을 서술하시오.

del은 원본 데이터의 값을 지우고 drop함수는 원본 데이터는 변경하지 않고 지운 값을 반환한다

### 실습예제 13
인덱스가 'Brendan Haywood', 'Cory Joseph', 'Darius Miller'이고 컬럼(열)이 'one', 'two', 'three', 'four', 'five'인 3x5 데이터프레임을 만드시오(이름은 sample으로 하고, 값은 0부터 차례대로 채우시오)

In [15]:
sample = DataFrame(np.arange(15).reshape((3, 5)),
                 index=['Brendan Haywood', 'cory Joseph', 'Darius Miller'],
                 columns=['one', 'two', 'three', 'four', 'five'])
sample

                 one  two  three  four  five
Brendan Haywood    0    1      2     3     4
cory Joseph        5    6      7     8     9
Darius Miller     10   11     12    13    14

### 실습예제 14
sample 데이터에서 컬럼 four의 값이 5 이상인 값들을 가져오시오

In [16]:
sample[sample['four']>=5]

               one  two  three  four  five
cory Joseph      5    6      7     8     9
Darius Miller   10   11     12    13    14

### 실습예제 15
sample 데이터에서 2번째부터 3번째까지 로(행)을 가져오시오

In [17]:
sample[1:3]

               one  two  three  four  five
cory Joseph      5    6      7     8     9
Darius Miller   10   11     12    13    14

### 실습예제 16
sample 데이터에서 칼럼 'one'과 'five'를 가져오시오

In [18]:
sample[['one','five']]

                 one  five
Brendan Haywood    0     4
cory Joseph        5     9
Darius Miller     10    14

### 실습예제 17
sample 데이터의 five 칼럼이 9인 값의 컬럼 3번째 까지 값을 가져오시오

In [24]:
sample.ix[sample['five']>9, :3]

               one  two  three
Darius Miller   10   11     12

### 실습예제 18
lambda를 이용하여 sample데이터의 평균을 구하시오

In [25]:
mean = lambda x : sum(x)/len(x)
sample.apply(mean)

one      5.0
two      6.0
three    7.0
four     8.0
five     9.0
dtype: float64